espressif/developer-portal-codebase/content/workshops/esp-idf-advanced/assignment_3_2_base/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.4.2 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_FREERTOS_ISR_STACKSIZE=2096
CONFIG_ALARM_THRESHOLD_PERCENT=50
